In [1]:
import pandas as pd

**Es el momento de poner en pr치ctica los groupbyde pandas. Para esto vamos a trabajar con el csv creado en el ejercicio de pair programming anterior.**
**El objetivo de este ejercicio es agrupar los datos para contestar las siguientes preguntas:**

In [2]:
attackito_supremo= pd.read_csv("./attackito_supremo.csv", index_col = 0)
attackito_supremo
attackito_supremo.head()

,case number,year,type,country,area,location,activity,name,sex,age,time,species,fatal (y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,N,Minor injury to left thigh,18-Jun-2018
2,2018.06.09,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,07h45,NaN,N,Injury to left lower leg from surfboard skeg,09-Jun-2018
3,2018.06.08,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,NaN,NaN,2 m shark,N,Minor injury to lower leg,08-Jun-2018
4,2018.06.04,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,NaN,NaN,"Tiger shark, 3m",N,Lacerations to leg & hand shark PROVOKED INCIDENT,04-Jun-2018

**1. 쮺u치ntos ataques hubo por pa칤s? Devuelve un dataframe.**
>**游늷 NOTA Ordena los resultados de mayor a menor. Esto todav칤a no lo hemos visto, pero un dataframe lo podemos ordenar con .sort_values(). Aqu칤 ten칠is una explicaci칩n de como hacerlo.**

In [3]:
ataques_pais = pd.DataFrame(attackito_supremo.groupby("country")["type"].count().sort_values(ascending= False))
ataques_pais

                  type
country
USA               2222
AUSTRALIA         1334
SOUTH AFRICA       577
PAPUA NEW GUINEA   134
NEW ZEALAND        127
...                ...
GUATEMALA            1
GREENLAND            1
GRAND CAYMAN         1
GHANA                1
MALDIVES             1

[212 rows x 1 columns]

**2. 쮺u치ntos ataques ha habido por a침o? Devuelve un dataframe. De nuevo ordena los resultados de mayor a menor.**

In [4]:
ataques_a침o = pd.DataFrame(attackito_supremo.groupby("year")["country"].count().sort_values(ascending= False)).reset_index()
ataques_a침o

       year  country
0    2015.0      143
1    2017.0      135
2    2016.0      130
3    2011.0      128
4    2014.0      125
..      ...      ...
244  1555.0        0
245  1811.0        0
246  1801.0        0
247    77.0        0
248  1742.0        0

[249 rows x 2 columns]

**3. 쮺u치ntos ataques hubo por a침o y sexo? Devolved un dataframe solo del a침o 2000 en adelante.**

In [7]:
#year= []
#sex= []
ataques_a침oysex = pd.DataFrame(attackito_supremo.groupby(["year","sex "])["case number"].count().sort_values(ascending= False))
#& (attackito_supremo["year"] > 2000)
ataques_a침oysex

             case number
year   sex
2015.0 M             114
2011.0 M             109
2016.0 M             105
0.0    M             104
2008.0 M             103
...                  ...
1893.0 F               1
1815.0 M               1
1816.0 M               1
1939.0 F               1
1931.0 F               1

[352 rows x 1 columns]

**4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA. 쮺u치ntos de los ataques fueron letales por sexo? Devuelve un dataframe**

In [ ]:
ataques_paises = pd.DataFrame(attackito_supremo.groupby("country")== )

**5. Usando el dataframe creado en el ejercicio anterior. 쮼n que pais hubo m치s ataques?**

**6. 쯈u칠 y cu치ntos tipos de ataques hubo por pais?**